# -*- coding: utf-8 -*-
"""
@author:XuMing(xuming624@qq.com)
@description: 
"""
import sys

sys.path.append('..')
from relext import RelationExtraction

article1 = """
    女子以开金店为由，将丈夫骗进传销窝点后，拿走手机不知去向。被民警（派出所的）解救后，男子觉得不可思议。近日，咸阳市公安局彩虹分局捣毁一传销窝点，解救被骗群众9人。
　　传销团伙人员构成多为亲戚和朋友
　　9月13日，咸阳市公安局彩虹分局西区派出所民警在日常走访调查中发现，辖区某小区121号楼经常有外地人频繁出入，疑似为一传销窝点。民警经过连日守候，发现涉及人员较多，根据掌握的情况，9月15日上午10时许，彩虹分局西区派出所民警全员出动，立即查处。
　　民警以查电表为名叫开门后，发现这户88平方米的房间里竟然住着7男2女，正在组织学习。他们均为外地口音，分别来自山东、湖南、湖北、广西等地。通过现场检查，证实确为一传销团伙。民警将现场所有人员带回派出所，现场查获收缴笔记本10余本，查获身份证16个。
　　经调查询问，该传销团伙以销售化妆品为名，采取拉人头入伙的方法，骗取亲友加入该团伙。凡拉人入伙购买一份价值2900元的化妆品，上线业务员即得525元，从主管、主任、经理、老总各级都按不同比例和份额“分红”，级别越高分红越多。该组织共骗2名女子和7名男子先后入伙，人员构成多为亲戚和朋友，且不在一处，一个地方人员互不认识，成员不停地处于流动状态，且组成人员具有很强的反侦查意识。
　　学习笔记记录要“敢突破、不要脸”
　　其中有一名湖南籍男子张某，是其妻子以开金店为名将其骗到咸阳，14日晚吃过饭后，妻子将他带至该处后便不知去向，还拿走了他的手机。在民警告知后，该男子感觉到十分震惊和不可思议。
　　民警介绍，在现场查获的学习笔记本上，记录着要以“旅游、找工作、干工程、谈朋友”等为借口，以“电话、书信、面对面和上门邀约”的方式，将“亲人、邻居、同学、同事等有责任心、事业心”的发展对象骗至传销窝点，通过“铺底、摸底、吸引、聊色”等交谈话题，“谈人生、谈理想、谈未来”，做到“敢突破、不要脸”，充满“孤独感、恐惧感、使命感、神秘感”，学会“接受、承受、享受”……“在说不出、解决不了的时候要转移话题…”“行业中正确的方式方法就是骗，骗等于技巧，技巧绝不等于骗…”等字眼，手段卑劣，触目惊心。
    """

article2 = """
    南京新街口胖哥见义勇为完整事件
    5月29日晚，南京新街口闹市区发生一起“驾车撞人并持刀捅人”事件。
    据央视报道披露的细节，5月29日21时许，犯罪嫌疑人吉某某驾驶租来的白色轿车，在秦淮区金銮巷将其前妻撞倒在地，现场热心市民阻拦无果后，吉某某再次碾压该女子后逃离现场。慌乱中，吉某某与其他车辆发生碰撞，安全气囊弹出，导致其所驾驶车辆无法行驶。
    随后，犯罪嫌疑人吉某某在现场持刀抢得一辆轿车后，继续逃窜。在洪武路和中山东路交叉口再次发生交通事故，所抢车辆无法驾驶。犯罪嫌疑人吉某某被热心市民围堵，其中一身形较胖的热心男子，被吉某某用刀刺伤，现场多名群众也不同程度受伤。犯罪嫌疑人吉某某自杀未遂，被警方控制。
    南京新街口伤人案嫌犯已被刑拘
    2021年5月30日下午1时5分，南京市政府新闻办召开新闻发布会，通报5月29日晚间发生的男子驾车撞人并持刀捅人一案详情，以及各方处置情况的最新进展。
    据通报，2021年5月29日21时45分许，南京公安110接群众报警，称秦淮区金銮巷有人驾车撞人并持刀捅人。南京市公安机关迅速组织警力赶赴现场处置，于21时49分到达第一现场开展调查和追缉工作。
    经查，犯罪嫌疑人吉某某（男，41岁，江苏滨海人，在南京无业、无固定住所）与前妻张某（女，42岁，江苏睢宁人）因感情纠纷等矛盾，在金銮巷（第一现场）驾驶租赁的白色标致牌轿车撞倒前妻张某与其朋友刘某某（男，43岁，安徽宿县人）及路人何某某（女，54岁，暂住在本市秦淮区），随后下车持刀捅伤刘某某，又上车驾驶车辆数次碾压张某后开车逃窜，在程阁老巷路口将路人鞠某某（女，24岁，本市人）撞伤。
    随后，吉某某驾车在中山南路和中山东路路口（第二现场）与张某某（男，本市人）驾驶的黑色别克牌轿车相碰擦，吉某某下车割伤自己的脖子，张某某等人见吉某某持刀且身上有血遂弃车离开。因白色标致牌轿车安全气囊弹开已无法行驶，吉某某即驾现场碰擦的黑色别克牌轿车沿中山东路往东快速逃窜，在洪武路和中山东路路口（第三现场）与多辆汽车发生碰撞，并将两名路人周某某（女，27岁，本市人）、陈某某（女，25岁，本市人）撞伤。
    其所驾车辆失控撞至路牙无法继续行驶，即窜入停在现场的一辆宝马牌汽车，驾车左拐往洪武路逆向行驶，与被堵在现场的车辆发生正面碰撞无法行驶，此时市民邱某某（男，33岁，本市人）前来阻止，吉某某下车持刀将邱某某捅伤。22时07分，吉某某被赶到现场的民警控制。目前，犯罪嫌疑人吉某某已被采取刑事拘留强制措施，受伤的犯罪嫌疑人及受害群众被送往医院救治。
    经初步侦查，这是一起由犯罪嫌疑人吉某某因个人感情等矛盾引发的故意杀人案件，公安机关正在严格依法抓紧办案，犯罪嫌疑人必将受到法律的严惩。案件发生后，许多热心市民向警方报警并现场协助阻止犯罪，警方对热心群众的见义勇为行为表示敬佩和衷心感谢，南京的平安离不开广大人民群众的共同呵护。今后，南京市公安机关将按照市委、市政府的部署，加强对各类风险隐患的排查整治，始终保持对违法犯罪行为严打高压态势，不断深化平安南京建设，全力保障人民群众生命财产安全。
    对于伤员目前救治情况，据通报，受伤的8名人员中，除1人为轻微伤已于当晚出院外，还有7名受伤人员在医院接受治疗。包括中度伤1人，重伤2人，危重4人，目前生命体征均平稳。其中，网民关注的被刺伤的“胖哥”已接受急诊腹内探查修补手术；犯罪嫌疑人前妻，因全身多处碾压伤目前在ICU诊治；犯罪嫌疑人目前已做气管插管、接受颈部外伤手术，在ICU治疗。
    南京遭碾压女子离婚前曾被家暴
    目前被碾压的前妻即受害者张某现在的情况如何呢？
    事发之后，犯罪嫌疑人和受害者的17岁儿子，紧急在救助平台为母亲发起筹款申请。
    儿子称，妈妈被反复碾压后，当场昏厥，医生给的诊断是，身体多处骨折，肺部挫伤，肝有囊肿，盆腔积液，现在还没有脱离生命危险，仍在ICU抢救。
    儿子在认证资料中称，受害者家庭年收入不到10万元，没有医保，其家庭无房产、无车辆、无金融资产，负债20万以上。无奈之下只好选择向社会众筹。
    而这起众筹也受到了非常积极的反馈，仅仅一夜之间，就有近2万人次帮助其捐款49万余元。筹款49万的目标已经完成，捐款通道已关闭。
    一位受害者的前同事在网络上发帖，曝出受害者与犯罪嫌疑人之间的恩怨纠葛。爆料中称，肇事者是她前夫，已经对其家暴多年，两人离婚三年之后，前夫依然对她百般纠缠，并向她索要三万元，不给的话扬言要杀她全家。
    她自从离婚后，一直饱受前夫的骚扰，她做餐饮连锁店都做到区长了，前途一片美好，就因为前夫的频繁骚扰，影响了她的事业，导致她离职。
    知情人称，她没有出轨，她如此真诚且美好，却依然惨遭恶毒前夫的毒手。
    南京胖哥曾是铅球运动员
    围堵犯罪嫌疑人吉某某的热心市民被刀刺伤后陆续送往医院，其中一身形较胖的男子受伤较重，据了解他姓邱，今年33岁，南京本地人，以前是一名铅球运动员，网友们称他为“南京胖哥”。
    据南京市卫健委公布，事件里8名受伤人员中，除1人为轻微伤已于当晚出院外，还有7名受伤人员在医院接受治疗。包括中度伤1人，重伤2人，危重4人，目前生命体征均平稳。其中犯罪嫌疑人前妻，因全身多处碾压伤目前在ICU诊治；犯罪嫌疑人目前已做气管插管、接受颈部外伤手术，在ICU治疗。（综合媒体报道）
"""

article3 = """
    雷洋，中国人民大学研究生毕业后留京工作，在环保领域崭露头角，已成青年才俊。5月7日晚，他要到四十公里外的北京机场迎接老家亲戚，为新出生的女儿庆生。但是，走出家门大约一个多小时，他就在昌平区公安分局东小口派出所警察控制期间意外死亡。8日，“雷洋之死”上网，9日、10日迅速刷屏。
    10日，新京报、财新等媒体实地探访事发地，目击者称，多名便衣警察，所用车辆没有警用标志，制服雷洋时因其大喊救命引来了110。距离所谓的嫖娼地点，雷洋要往地铁口的反方向步行800米，他究竟因何而遭遇警察被抓，目前不得而知。
    雷洋家属最想不通的是，10点钟雷洋就死了，为何凌晨1点才通知家属？雷洋手机里的信息为何被删除？既然雷洋跳车头部未着地，为何头上有伤？一个常踢足球才29岁的年轻人，没有心脏病史，怎么会突然死于心脏病？这些疑问，如果没有正确答案，就会让我们每个人恐惧。
    在派出所得知了丈夫去世的消息，“嫖娼”“反抗”“死亡”，这是雷洋妻子得到的关键词。根据警方对家属的讲述，他们在足疗店外蹲守，雷洋出店之后，试图将他控制，雷洋情绪激动，控制他时头部曾受伤，上车后雷洋试图跳车，因此心脏病发。然而，雷洋的出门时间，成为事件发生后警方与家属争议不下的谜题。据她回忆，雷洋应该是在八点半到九点之间出门。当时他在家里玩手机，岳父催他，他才出门。可警方通报说当晚8时左右，警方接到群众举报，霍营街道某小区存在卖淫嫖娼问题。在我们看来，并不需要福尔摩斯出场，谁是谁非，这个问题并不难查清。
    人民日报对此评论说，“人命关天”，对司法机关而言，如果在执法过程中，当事人遭遇了非正常死亡，那么对死因的说明尤应审慎、全面。只有给出令人信服的解答、作出经得起核查的结论，才是对死者及其亲属最负责任的交代，也才能从根本上疏导公共空间的不信任情绪。无论如何，不弃微末、从点滴做起，法治灯塔才能照亮社会的每一处角落。习近平总书记强调，“要努力让人民群众在每一个司法案件中都感受到公平正义”。当一个普通人的意外之死激起网络热议，这种关切与讨论，既是对有关部门应对舆情能力的考验，更是开展互动、树立司法公信的一次契机。
    也许，我们需要的是一点耐心，给真相一点时间。但是，执法录像、通讯记录、涉案细节、相关口供等是否公布、何时公布、如何公布，真相何时大白，这个力敌千钧的拷问正在考验着当地警方应对舆论升温的能力和回应公众关切的诚意。
"""

if __name__ == '__main__':
    m = RelationExtraction()
    triples = m.extract(article3)
    print(triples)
    m.show_triples(triples)
